#Найдите сумму цифр трехзначного числа. 
# a = int(input('Введите трёхзначное число: '))
# d1 = a % 10
# a //= 10
# d2 = a % 10
# a //= 10
# print('Сумма цифр числа:', a + d1 + d2)

#Петя, Катя и Сережа делают из бумаги журавликов. Вместе
#они сделали S журавликов. Сколько журавликов сделал каждый
#ребенок, если известно, что Петя и Сережа сделали одинаковое
#количество журавликов, а Катя сделала в два раза больше журавликов,
#чем Петя и Сережа вместе?

# s = int(input('Сколько всего журавликов: '))
# k = int((a/3)*2)
# p = int((k/2)/2)
# s = int(p)

# print(p, k, s)

#Задача 3

# b = [3,8,5,9,1,6]
# left = sum(b[0:-3])
# right = sum(b[-3:])

# if left == right:
#     print('Билет счастливый')
# else:
#     print('Билет не счастливый')
